app/controllers/docentes_controller.rb

  def index
   #@docentes = Docente.all
    @docentes = Docente.search(params[:search])
---
SELECT * FROM `docentes`